tutorials/cases/solidAdvection/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application porousGasificationFoam;

startFrom       latestTime;

startTime       0; 

stopAt          endTime;

endTime         1e-0;

deltaT          1e-2;

maxDeltaT	    0.001;

writeControl    adjustableRunTime;

writeInterval   1e-3;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep no;

maxCo      1; 

maxDi      5000;

functions
{
//    #includeFunc  probes
//    #includeFunc  sample

    // Regression-test scalars (see applications/test/regression/).
    // The include is silent if the file is absent, so removing
    // regressionFunctions reverts the case to its original behaviour.
    #includeIfPresent "regressionFunctions"

    // ---- TUI-monitor support (probes panel + heatmap validation) ---- //

    // Probes at inlet/outlet sides, through the solid Z range, so the
    // monitor's probes panel has live data during a serial run.
    probes
    {
        type            probes;
        libs            (sampling);
        enabled         true;
        writePrecision  10;
        writeControl    timeStep;
        writeInterval   1;
        fields          (Ycharm Yashm Yhumm Yrubberwoodm Ts porosityF Ychar);
        // Z=0.0005 is the mid-cell Z for the single-layer mesh
        // (Z in [0, 0.001]); Y=0.005 is mid-channel (Y in [0, 0.01]).
        probeLocations
        (
            (0.002 0 0.0005)       // inlet-mid
            (0.018 0 0.0005)       // outlet-mid
            (0.002 0.005 0.0005)   // inlet-mid-Y
            (0.018 0.005 0.0005)   // outlet-mid-Y
        );
    }
}

// ************************************************************************* //
